burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_fmc.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(data)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0005U), ERR_PARAM_POINTER);
    } else if(NOT_FMC_FLASH_WORD_ADDRESS(address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0005U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
        if(FMC_READY == fmc_state) {
            /* set the PG bit to start program */
            FMC_SECCTL |= FMC_SECCTL_SECPG;

            for(uint32_t i = 0U; i < size; i++) {
                REG32(address) = data[i];
                address += 4U;
            }

            /* reset the PG bit */
            FMC_SECCTL &= ~FMC_SECCTL_SECPG;
        }
#else /* __ARM_FEATURE_CMSE */
        if(FMC_READY == fmc_state) {
            /* set the PG bit to start program */
            FMC_CTL |= FMC_CTL_PG;

            for(uint32_t i = 0U; i < size; i++) {
                REG32(address) = data[i];
                address += 4U;
            }

            /* reset the PG bit */
            FMC_CTL &= ~FMC_CTL_PG;
        }
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      enable SRAM1 reset automatically function (API_ID(0x0007U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void sram1_reset_enable(void)
{
    fmc_state_enum fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        FMC_OBR |= (uint32_t)(FMC_OBR_SRAM1_RST);
        /* start option bytes modification */
        FMC_CTL |= FMC_CTL_OBSTART;
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    }
}

/*!
    \brief      disable SRAM1 reset automatically function (API_ID(0x0008U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void sram1_reset_disable(void)
{
    fmc_state_enum fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        FMC_OBR &= ~(uint32_t)(FMC_OBR_SRAM1_RST);
        /* start option bytes modification */
        FMC_CTL |= FMC_CTL_OBSTART;
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    }
}

/*!
    \brief      enable the privileged access (API_ID(0x0009U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_privilege_enable(void)
{
    FMC_PRIVCFG |= (uint32_t)(FMC_PRIVCFG_FMC_PRIV);
}
/*!
    \brief      disable the privileged access (API_ID(0x000AU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_privilege_disable(void)
{
    FMC_PRIVCFG &= ~(uint32_t)(FMC_PRIVCFG_FMC_PRIV);
}

/*!
    \brief      unlock the option bytes operation (API_ID(0x000BU))
                it is better to used in pairs with ob_lock
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_unlock(void)
{
    if(RESET == (FMC_CTL & FMC_CTL_OBWEN)) {
        /* write the FMC ob unlock key */
        FMC_OBKEY = UNLOCK_KEY0;
        FMC_OBKEY = UNLOCK_KEY1;
    }
}

/*!
    \brief      lock the option bytes operation (API_ID(0x000CU))
                it is better to used in pairs with ob_unlock after an operation
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_lock(void)
{
    /* reset the OBWEN bit */
    FMC_CTL &= ~FMC_CTL_OBWEN;
}

/*!
    \brief      send option bytes modification start command (API_ID(0x000DU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_start(void)
{
    /* set the OB_START bit in FMC_CTL register to start option bytes modification */
    FMC_CTL |= FMC_CTL_OBSTART;
}

/*!
    \brief      reload option bytes (API_ID(0x000EU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_reload(void)
{
    /* set the FMC_CTL_OBRLD bit in FMC_CTL register to reload option bytes */
    FMC_CTL |= FMC_CTL_OBRLD;
}

/*!
    \brief      configure security protection (API_ID(0x000FU))
                programmer must ensure FMC & option bytes are both unlocked before calling this function
    \param[in]  ob_spc: specify security protection
                only one parameter can be selected which is shown as below:
      \arg        FMC_NSPC: no security protection
      \arg        FMC_SPC_P0_5: security protection level 0.5
      \arg        FMC_SPC_P1: security protection level 1
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OBERR: option bytes error
      \arg        FMC_SECERR: secure program error, only available in secure mode
*/
fmc_state_enum ob_security_protection_config(uint8_t ob_spc)
{
    fmc_state_enum fmc_state = FMC_TOERR;
    
    fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    if(FMC_READY == fmc_state) {
        FMC_OBR &= FMC_OBR_SPC_MASK;
        FMC_OBR |= ob_spc;
        /* start option bytes modification */
        FMC_CTL |= FMC_CTL_OBSTART;
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    }
    /* return the FMC state */
    return fmc_state;
}

#if defined (GD32F5HC)
/*!
    \brief      configure the option byte for fwdgt/deepsleep/standby (API_ID(0x0010U))
    \param[in]  ob_fwdgt: option byte watchdog value
                only one parameter can be selected which is shown as below:
      \arg        OB_FWDGT_SW: software free watchdog
      \arg        OB_FWDGT_HW: hardware free watchdog
    \param[in]  ob_deepsleep: option byte deepsleep reset value
                only one parameter can be selected which is shown as below:
      \arg        OB_DEEPSLEEP_RUN: FWDGT is running in system deepsleep mode
      \arg        OB_DEEPSLEEP_SUSPEND: FWDGT is suspend in system deepsleep mode
    \param[in]  ob_stdby: option byte standby reset value
                only one parameter can be selected which is shown as below:
      \arg        OB_STDBY_RUN: FWDGT is running in system standby mode
      \arg        OB_STDBY_SUSPEND: FWDGT is suspend in system standby mode
    \param[out] none
    \retval     none
*/
void ob_wdgt_config(uint32_t ob_fwdgt, uint32_t ob_deepsleep, uint32_t ob_stdby)
{
    fmc_state_enum fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        FMC_OBR1 &= ~(FMC_OBR1_NWDG_HW | FMC_OBR1_FWDGSPD_DPSLP | FMC_OBR1_FWDGSPD_STDBY);
        FMC_OBR1 |= (ob_fwdgt | ob_deepsleep | ob_stdby);
        /* start option bytes modification */
        FMC_CTL |= FMC_CTL_OBSTART;
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    }
}

/*!
    \brief      configure the option byte for boot0/boot1 (API_ID(0x0011U))
    \param[in]  swboot0: SWBOOT0 option bits
                only one parameter can be selected which is shown as below:
      \arg        OB_BOOT0_NBOOT0: Select nBOOT0 as BOOT0 signal
      \arg        OB_BOOT0_PC8: Select PC8 pin as BOOT0 signal
    \param[in]  boot0: BOOT0 option bits (only valid when swboot0 is OB_BOOT0_NBOOT0)
                only one parameter can be selected which is shown as below:
      \arg        OB_BOOT0_1: BOOT0 is 1
      \arg        OB_BOOT0_0: BOOT0 is 0
    \param[in]  swboot1: SWBOOT1 option bit
                only one parameter can be selected which is shown as below:
      \arg        OB_BOOT1_NBOOT1: Select nBOOT1 as BOOT1 signal
      \arg        OB_BOOT1_PA14: Select PA14 pin as BOOT1 signal
    \param[in]  boot1: BOOT1 option bits (only valid when swboot1 is OB_BOOT1_NBOOT1)
                only one parameter can be selected which is shown as below:
      \arg        OB_BOOT1_1: BOOT1 is 1
      \arg        OB_BOOT1_0: BOOT1 is 0
    \param[out] none
    \retval     none
*/
void ob_boot_config(uint32_t swboot0, uint32_t boot0, uint32_t swboot1, uint32_t boot1)
{
    fmc_state_enum fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        FMC_OBR1 &= ~(FMC_OBR1_NSWBOOT0 | FMC_OBR1_NBOOT0 | FMC_OBR1_SWBOOT1 | FMC_OBR1_NBOOT1);
        FMC_OBR1 |= (swboot0 | boot0 | swboot1 | boot1);
        /* start option bytes modification */
        FMC_CTL |= FMC_CTL_OBSTART;
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    }
}
#endif /* defined (GD32F5HC) */

/*!
    \brief      enable trustzone (API_ID(0x0012U))
    \param[in]  none
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OBERR: option bytes error
      \arg        FMC_SECERR: secure program error, only available in secure mode
*/
fmc_state_enum ob_trustzone_enable(void)
{
    fmc_state_enum fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        FMC_OBR |= (uint32_t)(FMC_OBR_TZEN);
        /* start option bytes modification */
        FMC_CTL |= FMC_CTL_OBSTART;
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      disable trustzone (API_ID(0x0013U))
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus ob_trustzone_disable(void)
{
    ErrStatus err;
    uint32_t reg;
    fmc_state_enum fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    FlagStatus flag_spc1 = ob_security_protection_flag_get(OB_FLAG_SPC1);
    FlagStatus flag_spc0_5 = ob_security_protection_flag_get(OB_FLAG_SPC0_5);
    
    if(flag_spc1 || flag_spc0_5) {
        /* TZEN bit must be cleared at the same time that flash security protection return to unprotected */
        reg = FMC_OBR;
        reg &= ~(uint32_t)(FMC_OBR_TZEN);
        reg &= FMC_OBR_SPC_MASK;
        reg |= (uint32_t)(FMC_NSPC);

        if(FMC_READY == fmc_state) {
            FMC_OBR = reg;
            /* start option bytes modification */
            FMC_CTL |= FMC_CTL_OBSTART;
        }
        err = SUCCESS;
    } else {
        err = ERROR;
    }
    return err;
}

/*!
    \brief      program option bytes USER (API_ID(0x0014U))
                programmer must ensure FMC & option bytes are both unlocked before calling this function
    \param[in]  ob_user: option bytes user value
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OBERR: option bytes error
      \arg        FMC_SECERR: secure program error, only available in secure mode
*/
fmc_state_enum ob_user_write(uint16_t ob_user)
{
    fmc_state_enum fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        FMC_OBUSER &= FMC_OBUSER_MASK;
        FMC_OBUSER |= ob_user ;
        /* start option bytes modification */
        FMC_CTL |= FMC_CTL_OBSTART;
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure write protection pages (API_ID(0x0015U))
    \param[in]  wrp_spage: start page of write protection area, 0~512
    \param[in]  wrp_epage: end page of write protection area, 0~512
    \param[in]  wrp_register_index
                only one parameter can be selected which are shown as below:
      \arg        OBWRP_INDEX0: option byte write protection area register 0
      \arg        OBWRP_INDEX1: option byte write protection area register 1
    \param[out] none
    \retval     none
*/
fmc_state_enum ob_write_protection_config(uint32_t wrp_spage, uint32_t wrp_epage, uint32_t wrp_register_index)
{
    fmc_state_enum fmc_state = FMC_TOERR;
    
    fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    if(FMC_READY == fmc_state) {
        switch(wrp_register_index) {
        case OBWRP_INDEX0:
            FMC_OBWRP0 = 0U;
            FMC_OBWRP0 |= (wrp_spage & FMC_OBWRP0_WRP0_SPAGE);
            FMC_OBWRP0 |= ((wrp_epage << FMC_EPAGE_OFFSET) & FMC_OBWRP0_WRP0_EPAGE);
            break;
        case OBWRP_INDEX1:
            FMC_OBWRP1 = 0U;
            FMC_OBWRP1 |= (wrp_spage & FMC_OBWRP1_WRP1_SPAGE);
            FMC_OBWRP1 |= ((wrp_epage << FMC_EPAGE_OFFSET) & FMC_OBWRP1_WRP1_EPAGE);
            break;
        default :
            break;
        }
        /* start option bytes modification */
        FMC_CTL |= FMC_CTL_OBSTART;
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure secure mark pages (API_ID(0x0016U))
    \param[in]  secm_spage: start page of secure mark area, 0~0x03FF
    \param[in]  secm_epage: end page of secure mark area, 0~0x03FF
    \param[in]  secm_register_index
                only one parameter can be selected which are shown as below:
      \arg        SECM_INDEX0: secure mark configuration register 0
      \arg        SECM_INDEX1: secure mark configuration register 1
      \arg        SECM_INDEX2: secure mark configuration register 2
      \arg        SECM_INDEX3: secure mark configuration register 3
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OBERR: option bytes error
      \arg        FMC_SECERR: secure program error, only available in secure mode
*/
void ob_secmark_config(uint32_t secm_spage, uint32_t secm_epage, uint32_t secm_register_index)
{
    fmc_state_enum fmc_state;

    switch(secm_register_index) {
    case SECM_INDEX0:
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
        if(FMC_READY == fmc_state) {
            FMC_SECMCFG0 = 0U;
            FMC_SECMCFG0 |= (secm_spage & FMC_SECMCFG0_SECM0_SPAGE);
            FMC_SECMCFG0 |= ((secm_epage << FMC_EPAGE_OFFSET) & FMC_SECMCFG0_SECM0_EPAGE);
            /* start option bytes modification */
            FMC_CTL |= FMC_CTL_OBSTART;
        }
        break;
    case SECM_INDEX1:
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
        if(FMC_READY == fmc_state) {
            FMC_SECMCFG1 = 0U;
            FMC_SECMCFG1 |= (secm_spage & FMC_SECMCFG1_SECM1_SPAGE);
            FMC_SECMCFG1 |= ((secm_epage << FMC_EPAGE_OFFSET) & FMC_SECMCFG1_SECM1_EPAGE);
            /* start option bytes modification */
            FMC_CTL |= FMC_CTL_OBSTART;
        }
        break;
    case SECM_INDEX2:
        FMC_SECMCFG2 = 0U;
        FMC_SECMCFG2 |= (secm_spage & FMC_SECMCFG2_SECM2_SPAGE);
        FMC_SECMCFG2 |= ((secm_epage << FMC_EPAGE_OFFSET) & FMC_SECMCFG2_SECM2_EPAGE);
        break;
    case SECM_INDEX3:
        FMC_SECMCFG3 = 0U;
        FMC_SECMCFG3 |= (secm_spage & FMC_SECMCFG3_SECM3_SPAGE);
        FMC_SECMCFG3 |= ((secm_epage << FMC_EPAGE_OFFSET) & FMC_SECMCFG3_SECM3_EPAGE);
        break;
    default :
        break;
    }
}

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
/*!
    \brief      enable DMP region access right (API_ID(0x0017U))
    \param[in]  dmp_register_index
                only one parameter can be selected which are shown as below:
      \arg        DMP_INDEX0: secure DMP configuration register 0
      \arg        DMP_INDEX1: secure DMP configuration register 1
    \param[out] none
    \retval     none
*/
void ob_dmp_access_enable(uint32_t dmp_register_index)
{
    nvic_system_reset();
}

/*!
    \brief      disable DMP region access right (API_ID(0x0018U))
    \param[in]  DMP_register_index
                only one parameter can be selected which are shown as below:
      \arg        DMP_INDEX0: secure DMP configuration register 0
      \arg        DMP_INDEX1: secure DMP configuration register 1
    \param[out] none
    \retval     none
*/
void ob_dmp_access_disable(uint32_t DMP_register_index)
{
    switch(DMP_register_index) {
    case DMP_INDEX0:
        FMC_DMPCTL |= (uint32_t)(FMC_DMPCTL_DMP0_ACCCFG);
        break;
    case DMP_INDEX1:
        FMC_DMPCTL |= (uint32_t)(FMC_DMPCTL_DMP1_ACCCFG);
        break;
    default :
        break;
    }
}
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */

/*!
    \brief      configure DMP pages (API_ID(0x0019U))
    \param[in]  dmp_epage: end page of secure DMP mark area 0~0x03FF
    \param[in]  dmp_register_index
                only one parameter can be selected which are shown as below:
      \arg        DMP_INDEX0: secure DMP configuration register 0
      \arg        DMP_INDEX1: secure DMP configuration register 1
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus ob_dmp_config(uint32_t dmp_epage, uint32_t dmp_register_index)
{
    ErrStatus status = ERROR;
    uint32_t secm_epage;

