burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_fmc.c
    fmc_state_enum fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    if(FMC_READY == fmc_state) {
        switch(dmp_register_index) {
        case DMP_INDEX0:
            secm_epage = (FMC_SECMCFG0 & FMC_SECMCFG0_SECM0_EPAGE) >> FMC_EPAGE_OFFSET;
            if(secm_epage > dmp_epage) {
                FMC_DMP0 = 0U;
                FMC_DMP0 |= ((dmp_epage << FMC_EPAGE_OFFSET) & FMC_DMP0_DMP0_EPAGE);
                /* start option bytes modification */
                FMC_CTL |= FMC_CTL_OBSTART;
                status = SUCCESS;
            }
            break;
        case DMP_INDEX1:
            secm_epage = (FMC_SECMCFG1 & FMC_SECMCFG1_SECM1_EPAGE) >> FMC_EPAGE_OFFSET;
            if(secm_epage > dmp_epage) {
                FMC_DMP1 = 0U;
                FMC_DMP1 |= ((dmp_epage << FMC_EPAGE_OFFSET) & FMC_DMP1_DMP1_EPAGE);
                /* start option bytes modification */
                FMC_CTL |= FMC_CTL_OBSTART;
                status = SUCCESS;
            }
            break;
        default :
            break;
        }
    }
    return status;
}

/*!
    \brief      enable DMP function (API_ID(0x001AU))
    \param[in]  dmp_register_index:
                only one parameter can be selected which are shown as below:
      \arg        DMP_INDEX0: secure DMP configuration register 0
      \arg        DMP_INDEX1: secure DMP configuration register 1
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OBERR: option bytes error
      \arg        FMC_SECERR: secure program error, only available in secure mode
*/
fmc_state_enum ob_dmp_enable(uint32_t dmp_register_index)
{
    fmc_state_enum fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        switch(dmp_register_index) {
        case DMP_INDEX0:
            FMC_DMP0 |= (uint32_t)(FMC_DMP0_DMP0EN);
            break;
        case DMP_INDEX1:
            FMC_DMP1 |= (uint32_t)(FMC_DMP1_DMP1EN);
            break;
        default :
            break;
        }
        /* start option bytes modification */
        FMC_CTL |= FMC_CTL_OBSTART;
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      disable DMP function (API_ID(0x001BU))
    \param[in]  dmp_register_index:
                only one parameter can be selected which are shown as below:
      \arg        DMP_INDEX0: secure DMP configuration register 0
      \arg        DMP_INDEX1: secure DMP configuration register 1
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OBERR: option bytes error
      \arg        FMC_SECERR: secure program error, only available in secure mode
*/
fmc_state_enum ob_dmp_disable(uint32_t dmp_register_index)
{
    fmc_state_enum fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        switch(dmp_register_index) {
        case DMP_INDEX0:
            FMC_DMP0 &= (uint32_t)(~FMC_DMP0_DMP0EN);
            break;
        case DMP_INDEX1:
            FMC_DMP1 &= (uint32_t)(~FMC_DMP1_DMP1EN);
            break;
        default :
            break;
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure NO-RTDEC pages (API_ID(0x001CU))
    \param[in]  nodec_spage: start page of NO-RTDEC area, 0~0x03FF
    \param[in]  nodec_epage: end page of NO-RTDEC area, 0~0x03FF
    \param[in]  nodec_register_index
                only one parameter can be selected which are shown as below:
      \arg        NODEC_INDEX0: NO-RTDEC region register 0
      \arg        NODEC_INDEX1: NO-RTDEC region register 1
      \arg        NODEC_INDEX2: NO-RTDEC region register 2
      \arg        NODEC_INDEX3: NO-RTDEC region register 3
    \param[out] none
    \retval     none
*/
void fmc_no_rtdec_config(uint32_t nodec_spage, uint32_t nodec_epage, uint32_t nodec_register_index)
{
    switch(nodec_register_index) {
    case NODEC_INDEX0:
        FMC_NODEC0 = 0U;
        FMC_NODEC0 |= (nodec_spage & FMC_NODEC0_NODEC0_SPAGE);
        FMC_NODEC0 |= ((nodec_epage << FMC_EPAGE_OFFSET) & FMC_NODEC0_NODEC0_EPAGE);
        break;
    case NODEC_INDEX1:
        FMC_NODEC1 = 0U;
        FMC_NODEC1 |= (nodec_spage & FMC_NODEC1_NODEC1_SPAGE);
        FMC_NODEC1 |= ((nodec_epage << FMC_EPAGE_OFFSET) & FMC_NODEC1_NODEC1_EPAGE);
        break;
    case NODEC_INDEX2:
        FMC_NODEC2 = 0U;
        FMC_NODEC2 |= (nodec_spage & FMC_NODEC2_NODEC2_SPAGE);
        FMC_NODEC2 |= ((nodec_epage << FMC_EPAGE_OFFSET) & FMC_NODEC2_NODEC2_EPAGE);
        break;
    case NODEC_INDEX3:
        FMC_NODEC3 = 0U;
        FMC_NODEC3 |= (nodec_spage & FMC_NODEC3_NODEC3_SPAGE);
        FMC_NODEC3 |= ((nodec_epage << FMC_EPAGE_OFFSET) & FMC_NODEC3_NODEC3_EPAGE);
        break;
    default :
        break;
    }
}

/*!
    \brief      configure offset region (API_ID(0x001DU))
    \param[in]  of_spage: start page of offset region, 0~0x1FFF
    \param[in]  of_epage: end page of offset region, 0~0x1FFF
    \param[out] none
    \retval     none
*/
void fmc_offset_region_config(uint32_t of_spage, uint32_t of_epage)
{
    FMC_OFRG = 0U;
    FMC_OFRG |= (of_spage & FMC_OFRG_OF_SPAGE);
    FMC_OFRG |= ((of_epage << FMC_EPAGE_OFFSET) & FMC_OFRG_OF_EPAGE);
}

/*!
    \brief      configure offset value (API_ID(0x001EU))
    \param[in]  of_value: offset value, 0~0x1FFF
    \param[out] none
    \retval     none
*/
void fmc_offset_value_config(uint32_t of_value)
{
    FMC_OFVR = 0U;
    FMC_OFVR |= (of_value & FMC_OFVR_OF_VALUE);
}

/*!
    \brief      get option bytes write protection state, only applies to get the status of write/erase protection setting by EFUSE (API_ID(0x001FU))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus ob_write_protection_get(void)
{
    FlagStatus status = RESET;

    if(FMC_OBSTAT & FMC_OBSTAT_WP) {
        status = SET;
    } else {
        status = RESET;
    }

    /* return the state of corresponding FMC flag */
    return status;
}

/*!
    \brief      get the value of option bytes USER (API_ID(0x0020U))
    \param[in]  none
    \param[out] none
    \retval     the option bytes USER value
*/
uint16_t ob_user_get(void)
{
    /* return the FMC user option bytes value */
    return (uint16_t)FMC_OBUSER;
}

/*!
    \brief      get the FMC option bytes security protection state (API_ID(0x0021U))
    \param[in]  spc_state
                only one parameter can be selected which is shown as below:
      \arg        OB_FLAG_NSPC: option bytes security protection level 0
      \arg        OB_FLAG_SPC0_5: option bytes security protection level 0.5
      \arg        OB_FLAG_SPC1: option bytes security protection level 1
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus ob_security_protection_flag_get(uint32_t spc_state)
{
    FlagStatus state = RESET;

    spc_state &= FMC_OBSTAT_SPCSTAT_MASK; /* MASK for SPC state bits */

