burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_fmc.c
    if(OB_FLAG_NSPC == spc_state) {
        if(FMC_OBSTAT & FMC_OBSTAT_SPCSTAT_MASK) {
            state = RESET;
        } else {
            state = SET;
        }
    } else if(OB_FLAG_SPC0_5 == spc_state) {
        if(OB_FLAG_SPC0_5 == (FMC_OBSTAT & FMC_OBSTAT_SPCSTAT_MASK)) {
            state = SET;
        } else {
            state = RESET;
        }
    } else if(OB_FLAG_SPC1 == spc_state) {
        if(OB_FLAG_SPC1 == (FMC_OBSTAT & FMC_OBSTAT_SPCSTAT_MASK)) {
            state = SET;
        } else {
            state = RESET;
        }
    } else {
        state = RESET;
    }

    /* return the state of corresponding FMC flag */
    return state;
}

/*!
    \brief      get trustzone state (API_ID(0x0022U))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus ob_trustzone_state_get(void)
{
    FlagStatus state = RESET;

    if(FMC_OBSTAT & FMC_OBSTAT_TZEN_STAT) {
        state = SET;
    } else {
        state = RESET;
    }

    /* return the state of corresponding FMC flag */
    return state;
}

/*!
    \brief      get the state of whether the option byte exist or not (API_ID(0x0023U))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus ob_exist_state_get(void)
{
    FlagStatus state = RESET;

    if(FMC_OBSTAT & FMC_OBSTAT_FMCOB) {
        state = SET;
    } else {
        state = RESET;
    }

    /* return the state of corresponding FMC flag */
    return state;
}

/*!
    \brief      get FMC flag status (API_ID(0x0024U))
    \param[in]  flag: FMC flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_FLAG_BUSY: FMC busy flag
      \arg        FMC_FLAG_OBERR: FMC option bytes error flag
      \arg        FMC_FLAG_WPERR: FMC erase/program protection error flag
      \arg        FMC_FLAG_END: FMC end of operation flag
      \arg        FMC_FLAG_SECERR: FMC secure error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fmc_flag_get(uint32_t flag)
{
    FlagStatus status = RESET;

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
    if(FMC_FLAG_OBERR == flag) {
        if(FMC_STAT & flag) {
            status = SET;
        }
    } else {
        if(FMC_SECSTAT & flag) {
            status = SET;
        }
    }
#else
    if(FMC_STAT & flag) {
        status = SET;
    }
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */
    /* return the state of corresponding FMC flag */
    return status;
}

/*!
    \brief      clear the FMC flag (API_ID(0x0025U))
    \param[in]  flag: FMC flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_FLAG_OBERR: FMC option bytes error flag
      \arg        FMC_FLAG_WPERR: FMC erase/program protection error flag
      \arg        FMC_FLAG_END: FMC end of operation flag
      \arg        FMC_FLAG_SECERR: FMC secure error flag
    \param[out] none
    \retval     none
*/
void fmc_flag_clear(uint32_t flag)
{
#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
    if(FMC_FLAG_OBERR == flag) {
        FMC_STAT = flag;
    } else {
        /* clear the flags */
        FMC_SECSTAT = flag;
    }
#else
    /* clear the flags */
    FMC_STAT = flag;
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */
}

/*!
    \brief      enable FMC interrupt (API_ID(0x0026U))
    \param[in]  interrupt: the FMC interrupt
                only one parameter can be selected which is shown as below:
      \arg        FMC_INT_END: FMC secure/non-secure end of operation interrupt
      \arg        FMC_INT_ERR: FMC secure/non-secure error interrupt
    \param[out] none
    \retval     none
*/
void fmc_interrupt_enable(uint32_t interrupt)
{
#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
    FMC_SECCTL |= interrupt;
#else
    FMC_CTL |= interrupt;
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */
}

/*!
    \brief      disable FMC interrupt (API_ID(0x0027U))
    \param[in]  interrupt: the FMC interrupt
                only one parameter can be selected which is shown as below:
      \arg        FMC_INT_END: FMC secure/non-secure end of operation interrupt
      \arg        FMC_INT_ERR: FMC secure/non-secure error interrupt
    \param[out] none
    \retval     none
*/
void fmc_interrupt_disable(uint32_t interrupt)
{
#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
    FMC_SECCTL &= ~(uint32_t)interrupt;
#else
    FMC_CTL &= ~(uint32_t)interrupt;
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */
}

/*!
    \brief      get FMC interrupt flag (API_ID(0x0028U))
    \param[in]  flag: FMC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_INT_FLAG_WPERR: FMC secure/non-secure erase/program protection error interrupt flag
      \arg        FMC_INT_FLAG_END: FMC secure/non-secure end of operation interrupt flag
      \arg        FMC_INT_FLAG_SECERR: FMC secure error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fmc_interrupt_flag_get(uint32_t flag)
{
    FlagStatus status = RESET;

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
    if(FMC_SECSTAT & flag) {
        status = SET;
    }
#else
    if(FMC_STAT & flag) {
        status = SET;
    }
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */
    /* return the state of corresponding FMC flag */
    return status;
}

/*!
    \brief      clear FMC interrupt flag (API_ID(0x0029U))
    \param[in]  flag: FMC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_INT_FLAG_WPERR: FMC secure/non-secure erase/program protection error interrupt flag
      \arg        FMC_INT_FLAG_END: FMC secure/non-secure end of operation interrupt flag
      \arg        FMC_INT_FLAG_SECERR: FMC secure error flag
    \param[out] none
    \retval     none
*/
void fmc_interrupt_flag_clear(uint32_t flag)
{
#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
    /* clear the flags */
    FMC_SECSTAT = flag;
#else
    /* clear the flag */
    FMC_STAT = flag;
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */
}

/*!
    \brief      get the FMC state (API_ID(0x002AU))
    \param[in]  none
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
*/
static fmc_state_enum fmc_state_get(void)
{
    fmc_state_enum fmc_state = FMC_READY;

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
    if((uint32_t)0x00U != (FMC_SECSTAT & (FMC_SECSTAT_SECBUSY))) {
        fmc_state = FMC_BUSY;
    } else {
        if((uint32_t)0x00U != (FMC_SECSTAT & (FMC_SECSTAT_SECERR))) {
            fmc_state = FMC_SECERR;
        } else {
            if((uint32_t)0x00U != (FMC_SECSTAT & (FMC_SECSTAT_SECWPERR))) {
                fmc_state = FMC_WPERR;
            } else {
                if((uint32_t)0x00U != (FMC_STAT & (FMC_STAT_OBERR))) {
                    fmc_state = FMC_OBERR;
                }
            }
        }
    }
#else
    if((uint32_t)0x00U != (FMC_STAT & FMC_STAT_BUSY)) {
        fmc_state = FMC_BUSY;
    } else {
        if((uint32_t)0x00U != (FMC_STAT & FMC_STAT_WPERR)) {
            fmc_state = FMC_WPERR;
        } else {
            if((uint32_t)0x00U != (FMC_STAT & (FMC_STAT_OBERR))) {
                fmc_state = FMC_OBERR;
            }
        }
    }
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      check whether FMC is ready or not (API_ID(0x002BU))
    \param[in]  timeout: timeout count
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
fmc_state_enum fmc_ready_wait(uint32_t timeout)
{
    fmc_state_enum fmc_state = FMC_BUSY;

    /* wait for FMC ready */
    do {
        /* get FMC state */
        fmc_state = fmc_state_get();
        timeout--;
    } while((FMC_BUSY == fmc_state) && (0x00U != timeout));

    if(FMC_BUSY == fmc_state) {
        fmc_state = FMC_TOERR;
    }

    /* return the FMC state */
    return fmc_state;
}
